<template>
    <section class="pt-10 pb-16 md:py-20">
        <div class="container mx-auto">
            <h2 class="mb-6 border-l-8 border-brandRed pl-4 md:text-5xl/normal md:mb-8">常見問題</h2>
            <p class="mb-6 text-2xl/normal font-bold">我想詢問配鏡問題</p>
            <ul class="flex flex-col gap-6">
                <li v-for="(item, i) in qaList" :key="i">
                <h4 class="text-xl/normal font-bold mb-2">{{ item.ques }}</h4>
                <p class="whitespace-pre-line">{{ item.ans }}</p>
            </li>
            </ul>
        </div>
    </section>
</template>

<script>
    export default {
        setup () {
            const qaList = [
                {
                    ques: 'Q1.請問可否自備鏡框單配鏡片？',
                    ans: `A1.我牌鏡框搭配薄型非球面鏡片 1480 元，搭配功能型鏡片則依鏡片種類加價購買。
                    當日購買JINS盒裝眼鏡，搭配薄型非球面鏡片 980 元（隔日後則為 1480 元），搭配功能型鏡片則依鏡片種類加價購買。
                    他牌鏡框，搭配薄型非球面鏡片 1980 元，搭配功能型鏡片則依鏡片種類加價購買。`
                },
                {
                    ques: 'Q2.眼鏡都可以20分鐘取件嗎？',
                    ans: `A1.我牌鏡框搭配薄型非球面鏡片 1480 元，搭配功能型鏡片則依鏡片種類加價購買。
                    當日購買JINS盒裝眼鏡，搭配薄型非球面鏡片 980 元（隔日後則為 1480 元），搭配功能型鏡片則依鏡片種類加價購買。
                    他牌鏡框，搭配薄型非球面鏡片 1980 元，搭配功能型鏡片則依鏡片種類加價購買。`
                },
                {
                    ques: 'Q3.散光鏡片需要額外加價嗎？',
                    ans: `A1.我牌鏡框搭配薄型非球面鏡片 1480 元，搭配功能型鏡片則依鏡片種類加價購買。
                    當日購買JINS盒裝眼鏡，搭配薄型非球面鏡片 980 元（隔日後則為 1480 元），搭配功能型鏡片則依鏡片種類加價購買。
                    他牌鏡框，搭配薄型非球面鏡片 1980 元，搭配功能型鏡片則依鏡片種類加價購買。`
                },
                {
                    ques: 'Q4.我可以使用舊眼鏡的度數配鏡片嗎？',
                    ans: `A1.我牌鏡框搭配薄型非球面鏡片 1480 元，搭配功能型鏡片則依鏡片種類加價購買。
                    當日購買JINS盒裝眼鏡，搭配薄型非球面鏡片 980 元（隔日後則為 1480 元），搭配功能型鏡片則依鏡片種類加價購買。
                    他牌鏡框，搭配薄型非球面鏡片 1980 元，搭配功能型鏡片則依鏡片種類加價購買。`
                },
                {
                    ques: 'Q5.請問可以單購買鏡框嗎？',
                    ans: `A1.我牌鏡框搭配薄型非球面鏡片 1480 元，搭配功能型鏡片則依鏡片種類加價購買。
                    當日購買JINS盒裝眼鏡，搭配薄型非球面鏡片 980 元（隔日後則為 1480 元），搭配功能型鏡片則依鏡片種類加價購買。
                    他牌鏡框，搭配薄型非球面鏡片 1980 元，搭配功能型鏡片則依鏡片種類加價購買。`
                }
            ]
        
            return {
                qaList
            }
        }
    }
</script>